---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookEndType
source: html/d91b5322-b589-8e65-8cbd-b20123baf79a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookEndType Property

"Hook At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeHookEndType { get; }
```